---
kind: property
id: P:Autodesk.Revit.DB.Category.BuiltInCategory
source: html/c3359fec-7b8d-d106-9380-3ba232ac4d14.htm
---
# Autodesk.Revit.DB.Category.BuiltInCategory Property

Gets the BuiltInCategory value for this category.

## Syntax (C#)
```csharp
public BuiltInCategory BuiltInCategory { get; }
```